package metanit.basics;

//Это пример однострочного комментария. Обратите внимание, что название класса совпадает с названием файла.
public class L7_Program_Structure {
    /*
    Ниже пример метода который должен обязательно присутствовать
    в любой программе, в главном классе и из него вызываются другие методы других
    классов, а также происходит обращение к полям других классов и прочее.
     */
    public static void main(String[] args) {
        //Ниже идёт инструкция. Из инструкций состоят все программы. Они заканчиваются точкой с запятой.
        System.out.println("Good job!");//Это инструкция помещённая в блок кода.
    }
}
